saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.EFM32WGxxx_DFP.1.5.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.9" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>EFM32WGxxx_DFP</name>
  <description>Silicon Labs EFM32 Wonder Gecko Series Device Support</description>

  <releases>
    <release version="1.5.0" date="2018-01-15" deprecated="2018-01-15" replacement="SiliconLabs.EFM32WG_DFP">
      The maintenance of this pack will be discontinued and SiliconLabs is providing the new pack SiliconLabs.EFM32WG_DFP.
    </release>
    <release version="1.4.0" date="2017-06-22">
      Updated device support files to V5.1.3.
      Updated Flash Algorithms to 5.2.0.
      Updated SVD files to V5.2.1.
      Updated emlib, emdrv to V5.1.3.
      Updated documentation.
    </release>
    <release version="1.3.0" date="2016-04-22">
      Updated device support files to V4.2.1.
      Updated emlib, emdrv to V4.2.1.
    </release>
    <release version="1.2.0" date="2015-07-31">
      Updated device support files to V4.0.0.
      Added EFM32WG900 and EFM32WG360 devices.
      Added emlib support.
      Added EFM32WG_STK3800 Blinky example.
    </release>
    <release version="1.1.0" date="2015-04-10">
      Updated Flash Algorithm and set RAMstart, RAMsize to algorithm in device description.
      Updated EFM32WG device support files.
      Updated emlib to V3.20.13.
      Updated documentation.
      Changed Device Vendor to '"Silicon Labs:21".
    </release>
    <release version="1.0.1" date="2014-02-20">
      Device description updated with features and flash programming algorithms
    </release>
    <release version="1.0.0">
      First Release version of EFM32WG Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Silicon Labs</keyword>
    <keyword>EFM32WG</keyword>
    <keyword>EFM32</keyword>
  </keywords>

  <devices>
    <family Dfamily="EFM32WG Series" Dvendor="Silicon Labs:21">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
      <processor Dclock="48000000"/>

      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>

      <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
      <book name="Documents/EFM32WG-RM.pdf"              title="EFM32WG Reference Manual"/>

      <description>
Silicon Labs’ EFM32™ Wonder Gecko 32-bit microcontroller (MCU) family includes 60 devices based on the ARM® Cortex®-M4 core, which provides a full DSP instruction set and includes a hardware FPU for faster computation performance.

Wonder Gecko MCUs feature up to 256 kB of flash memory, 32 kB of RAM and CPU speeds up to 48 MHz.
The MCUs incorporate highly differentiated Gecko technology to minimize energy consumption, including a flexible range of standby and sleep modes, intelligent peripherals that allow designers to implement many functions without CPU wake-up and ultra-low standby current.
With the lowest active and standby power consumption, the Wonder Gecko is the world's most energy friendly Cortex-M4 MCU.
      </description>

      <feature type="AnalogOther"   n="3"                           name="Operational Amplifier"/>
      <feature type="Other"         n="1"                           name="Low Energy Sensor Interface (LESENSE)"/>

      <!-- ************************  Subfamily 'EFM32WG230'  **************************** -->
      <subFamily DsubFamily="EFM32WG230">
        <book name="Documents/EFM32WG230.pdf" title="EFM32WG230 Data Sheet"/>

        <feature type="IOs"           n="56"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32WG230F128'  ***************************** -->
        <device Dname="EFM32WG230F128">
          <compile header="Device/EFM32WG/Include/em_device.h"  define="EFM32WG230F128"/>
          <debug svd="SVD/EFM32WG/EFM32WG230F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32WG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32WG230F256'  ***************************** -->
        <device Dname="EFM32WG230F256">
          <compile header="Device/EFM32WG/Include/em_device.h"  define="EFM32WG230F256"/>
          <debug svd="SVD/EFM32WG/EFM32WG230F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32WG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32WG230F64'  ***************************** -->
        <device Dname="EFM32WG230F64">
          <compile header="Device/EFM32WG/Include/em_device.h"  define="EFM32WG230F64"/>
          <debug svd="SVD/EFM32WG/EFM32WG230F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32WG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32WG232'  **************************** -->
      <subFamily DsubFamily="EFM32WG232">
        <book name="Documents/EFM32WG232.pdf" title="EFM32WG232 Data Sheet"/>

        <feature type="IOs"           n="53"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32WG232F128'  ***************************** -->
        <device Dname="EFM32WG232F128">
          <compile header="Device/EFM32WG/Include/em_device.h"  define="EFM32WG232F128"/>
          <debug svd="SVD/EFM32WG/EFM32WG232F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32WG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

